### Creating DataFrames

In [1]:
import pandas as pd

### From Dictionary

In [4]:
dict01={'Age':[10,20,15],'Name':['Vinu','Anu','Dinu']}

In [5]:
df2=pd.DataFrame(dict01)

In [6]:
df2

   Age  Name
0   10  Vinu
1   20   Anu
2   15  Dinu

## DataFrame Using Lists

In [7]:
names = ["Manu",'Binu', 'Vinu']
age=[27,26,25]

In [11]:
df1 = pd.DataFrame(list(zip(names,age)), columns =['Names' , 'Age'])

In [12]:
df1

  Names  Age
0  Manu   27
1  Binu   26
2  Vinu   25

### DataFrame from Lists of Dictionaries

In [16]:
lst=[
    {'Name':'Arun', 'Age':29, 'Gender':'Male'},
    {'Name':'Manu', 'Age':28, 'Gender':'Male'},
    {'Name':'Safeer', 'Age':20, 'Gender':'Male'},
    {'Name':'Radhs', 'Age':27, 'Gender':'Feale'},
    {'Name':'Vivek', 'Age':28, 'Gender':'Male'},
]

In [17]:
df=pd.DataFrame(lst)

In [18]:
df

     Name  Age Gender
0    Arun   29   Male
1    Manu   28   Male
2  Safeer   20   Male
3   Radhs   27  Feale
4   Vivek   28   Male

### Ds1 DataFrame Using Lists

In [25]:
names = ['Vaisakh','Rinto raj','Joyal joseph','Saneesh Mathew','Aswathi V V','Reneesh V U','Viswanth V','Reshma Regunath','doniya','Adarsh balan','Farseen','Sooraj','Sreelakshmi','Geo','Anantha krishnan T','Aiswarya','Reshma A C','Siraj T M','Biben','Arun','Reshmi R Nair','Shaijal','Christy']
age = [23,25,25,32,23,27,26,22,22,24,23,32,28,24,24,25,26,25,25,31,21,21]
gender = ['M','M','M','M','F','M','M','F','F','M','M','M','F','M','M','F','F','M','M','M','F','M']
qualification = ['BBA','BTECH','BSC MATHS','BSC CS','BTECH','BSC CS','BTECH','BCA','BTECH','BTECH','BTECH','BCOM','MCA','12TH','BTECH','MSC STATICS','MSC MATHS','MCOM','BTECH','MBA','BTECH','BE CSE']

In [27]:
DS = pd.DataFrame(list(zip(names,age,gender,qualification)), columns=['Names','Age','Gender','Qualification'])

In [29]:
DS

                 Names  Age Gender Qualification
0              Vaisakh   23      M           BBA
1            Rinto raj   25      M         BTECH
2         Joyal joseph   25      M     BSC MATHS
3       Saneesh Mathew   32      M        BSC CS
4          Aswathi V V   23      F         BTECH
5          Reneesh V U   27      M        BSC CS
6           Viswanth V   26      M         BTECH
7      Reshma Regunath   22      F           BCA
8               doniya   22      F         BTECH
9         Adarsh balan   24      M         BTECH
10             Farseen   23      M         BTECH
11              Sooraj   32      M          BCOM
12         Sreelakshmi   28      F           MCA
13                 Geo   24      M          12TH
14  Anantha krishnan T   24      M         BTECH
15            Aiswarya   25      F   MSC STATICS
16          Reshma A C   26      F     MSC MATHS
17           Siraj T M   25      M          MCOM
18               Biben   25      M         BTECH
19                Arun   31      M           MBA
20       Reshmi R Nair   21      F         BTECH
21             Shaijal   21      M        BE CSE